# Manejo de Conjunto de Datos

## Importar librerías

In [3]:
import pandas as pd

## Concatenar conjunto de datos

In [15]:
red_wine = pd.read_csv('../datasets/wine/winequality-red.csv', delimiter = ';')
red_wine.shape

(1599, 12)

In [16]:
white_wine = pd.read_csv('../datasets/wine/winequality-white.csv', delimiter = ';')
white_wine.shape

(4898, 12)

In [23]:
wine_data = pd.concat([red_wine, white_wine], axis = 0)
wine_data.shape

(6497, 12)

In [22]:
wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

## Unión de conjunto de datos

In [69]:
data_main = pd.read_csv('../datasets/medals/medals.csv', encoding = "ISO-8859-1")
data_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [63]:
data_country = pd.read_csv('../datasets/medals/athlete_country_map.csv', encoding = 'ISO-8859-1')
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [64]:
data_sports = pd.read_csv('../datasets/medals/athlete_sports_map.csv', encoding = 'ISO-8859-1')
data_sports.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

### Eliminamos datos duplicados

In [65]:
data_country_dp = data_country.drop_duplicates(subset = 'Athlete')
data_country_dp.shape

(6956, 2)

In [66]:
data_sports_dp = data_sports.drop_duplicates(subset = 'Athlete')
data_sports_dp.shape

(6956, 2)

### Juntamos las tablas

In [67]:
# Esta operación realiza un inner join
data_main_country = pd.merge(left = data_main, right = data_country_dp,
                             left_on = 'Athlete', right_on = 'Athlete')
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [70]:
data_final = pd.merge(left = data_main_country, right = data_sports_dp,
                             left_on = 'Athlete', right_on = 'Athlete')
data_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming

## Tipos de uniones

### Inner Join

Devuelve un conjunto ocn las filas que tienen valor tanto en el primer como en el segundo conjunto.

### Left Join

Devuelve un conjunto con las filas que tuvieran valor en el conjunto de la izquierda sin importar si tienen correspondencia en el de la derecha o no. Si las filas del conjunto original no corresponde a ninguna fila del segundo conjunto, tendrán NAs en las columnas del conjunto derecho.

### Left Join

Devuelve un conjunto con las filas que tuvieran valor en el conjunto de la derecha sin importar si tienen correspondencia en el de la izquierda o no. Si las filas del conjunto original no corresponde a ninguna fila del segundo conjunto, tendrán NAs en las columnas del conjunto izquierdo.

### Outer Join

Devuelve toda la información de ambos conjuntos, reemplazando los elementos que no tengan correspondencia con NAs.